-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Host: localhost
-- Generation Time: Mar 09, 2024 at 01:35 PM
-- Server version: 10.4.26-MariaDB
-- PHP Version: 7.4.30

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `thannam_dbname2`
--

-- --------------------------------------------------------

--
-- Table structure for table `thannam_champion_teamm`
--

CREATE TABLE `thannam_champion_teamm` (
  `id` int(11) NOT NULL,
  `idgym` int(11) DEFAULT NULL,
  `nameA` varchar(255) NOT NULL,
  `teachA` varchar(255) DEFAULT NULL,
  `chochA` varchar(255) DEFAULT NULL,
  `contact` varchar(255) DEFAULT NULL,
  `password` varchar(100) NOT NULL,
  `match1` int(11) NOT NULL,
  `allnum` int(11) NOT NULL DEFAULT 0,
  `email` varchar(100) NOT NULL,
  `datea` datetime NOT NULL,
  `ip` varchar(100) NOT NULL,
  `totalscore` int(11) DEFAULT NULL,
  `numrank` decimal(11,2) DEFAULT 0.00,
  `numAB` decimal(5,3) DEFAULT 0.000,
  `numC` decimal(5,2) DEFAULT 0.00,
  `numD` decimal(5,2) DEFAULT 0.00,
  `numA` decimal(5,2) DEFAULT 0.00,
  `numB` decimal(5,2) DEFAULT 0.00,
  `numCD` decimal(5,2) DEFAULT 0.00,
  `numPoom` int(11) DEFAULT 0,
  `numSpeed` int(11) DEFAULT 0,
  `numBC` decimal(5,2) DEFAULT 0.00,
  `numABC` decimal(5,2) DEFAULT 0.00,
  `numPS` decimal(5,2) DEFAULT 0.00,
  `countryA` varchar(100) DEFAULT NULL,
  `numEvent` decimal(5,2) DEFAULT 0.00
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- Dumping data for table `thannam_champion_teamm`
--

INSERT INTO `thannam_champion_teamm` (`id`, `idgym`, `nameA`, `teachA`, `chochA`, `contact`, `password`, `match1`, `allnum`, `email`, `datea`, `ip`, `totalscore`, `numrank`, `numAB`, `numC`, `numD`, `numA`, `numB`, `numCD`, `numPoom`, `numSpeed`, `numBC`, `numABC`, `numPS`, `countryA`, `numEvent`) VALUES
(8789, NULL, 'H.M.A à¹€à¸—à¸„à¸§à¸±à¸™à¹‚à¸”à¸¥à¸³à¸žà¸¹à¸™', 'à¸„à¸£à¸¹à¸à¸£à¸°à¹€à¹€à¸• à¸„à¸£à¸¹à¸”à¸£à¸µà¸¡', '', '0824492535', '0824492535', 2034, 0, 'wiranya.7368@gmail.com', '2024-01-24 17:01:47', '2405:9800:b910:f665:a5a1:4a88:47c:fe2e', NULL, '1.14', '1.020', '0.00', '0.00', '0.00', '0.00', '0.00', 0, 0, '0.00', '0.00', '1.01', '', '0.00'),
(8842, NULL, 'TIN  taekwondo', 'à¸„à¸£à¸¹à¸—à¸´à¸™', 'à¸­.à¹à¸ªà¸š', '0982916450', '2516', 2034, 0, 'saranrachbum@gmail.com', '2024-02-07 08:56:15', '2403:6200:8841:7df5:4111:b567:5361:3156', NULL, '0.00', '0.000', '0.00', '0.00', '0.00', '0.00', '0.00', 0, 0, '0.00', '0.00', '7.00', '', '0.00'),
(8939, NULL, 'REW TAEKWONDO NAN', 'à¸„à¸£à¸¹à¸£à¸´à¸§', '', '0650290609', '14042543', 2034, 0, '0650290609', '2024-02-20 14:00:52', '2001:44c8:45c1:ce33:1:0:df33:12fd', NULL, '0.20', '0.100', '0.00', '0.00', '0.00', '0.00', '0.00', 0, 0, '0.00', '0.00', '0.00', '', '0.00'),
(8955, NULL, ' MASTER NU TAEKWONDO  ', 'à¸„à¸£à¸¹à¹ƒà¸«à¸à¹ˆ ', '', '0859174381', 'chatchai30', 2034, 0, 'tanawin_tkd@hotmail.com', '2024-02-22 10:21:57', '58.10.19.176', NULL, '4.20', '1.210', '0.00', '0.00', '0.00', '0.00', '0.00', 0, 0, '0.00', '0.00', '0.00', '', '2.00'),
(8958, NULL, ' DR.KHANITTHA ACADEMY ', 'à¸›à¸ à¸™à¸¥ à¸Šà¸¸à¸¡à¹€à¸žà¹‡à¸', 'à¸›à¸£à¸°à¹€à¸§à¸¨ à¸ªà¸±à¸•à¸•à¸²à¸„à¸¡', '080-9426499', '1234', 2034, 0, 'Knt_tkd@hotmail.com', '2024-02-22 12:52:53', '27.55.74.131', NULL, '9.26', '4.260', '0.00', '0.00', '0.00', '0.00', '0.00', 0, 0, '0.01', '0.00', '0.00', '', '6.00'),
(8971, NULL, 'à¸žà¸±à¸Šà¸£à¸°à¸¢à¸´à¸¡', 'à¸„à¸£à¸¹à¸žà¸¥', 'à¸„à¸£à¸¹à¹€à¸šà¸', '0631915433', '4485', 2034, 0, 'benze.patchara17@gmail.com', '2024-02-23 19:19:27', '2405:9800:b910:2389:f095:9f73:3e94:2aea', NULL, '6.23', '6.130', '0.00', '0.00', '0.00', '0.00', '0.00', 0, 0, '0.00', '0.00', '0.00', '', '1.00'),
(8973, NULL, 'INTHANON TAEKWONDO ACADEMY ', 'à¸„à¸£à¸¹à¹€à¸ˆà¸¡à¸ªà¹Œ', '', '081-0206385 ', '1234', 2034, 0, 'krujames_tkd@hotmail.com', '2024-02-24 00:15:20', '2405:9800:b910:c4d5:eca0:11d2:8b42:1850', NULL, '1.30', '0.100', '0.00', '0.00', '0.00', '0.00', '0.00', 0, 0, '0.00', '0.00', '0.00', '', '7.00'),
(8983, NULL, 'Blessing Taekwodo', 'Tae', 'Book', '0980539366', 'asd0832054539', 2034, 0, 'asd0971682043@gmail com', '2024-02-26 10:59:40', '2001:44c8:45d3:1661:1:0:fd3a:c5b0', NULL, '0.00', '0.000', '0.00', '0.00', '0.00', '0.00', '0.00', 0, 0, '0.00', '0.00', '0.00', '', '0.00'),
(8984, NULL, 'The Global Taekwondo ', 'à¸˜à¸™à¸±à¸™à¸—à¹Œà¸žà¸‡à¸¨à¹Œ', '', '098-2266593', '123456789', 2034, 0, 'priyarat.huang@gmail.com', '2024-02-26 14:28:56', '2405:9800:b910:9fa5:21a4:37c1:b88d:957a', NULL, '0.00', '0.000', '0.00', '0.00', '0.00', '0.00', '0.00', 0, 0, '0.00', '0.00', '0.00', '', '0.00'),
(8987, NULL, 'CTC Kenneth MacKenzie ', 'à¸„à¸£à¸¹à¹‚à¸›à¹€à¸•à¹‰ à¸­à¸±à¸©à¸Žà¸²à¸à¸£ à¸§à¸‡à¸¨à¹Œà¹à¸à¹‰à¸§', 'à¸˜à¸™à¸§à¸´à¸™à¸—à¹Œ à¸­à¸´à¸™à¸—à¹€à¸ªà¸™', '0612980963', 'wind5898', 2034, 0, 'Thanawin.intsan@gmail.com', '2024-02-26 20:33:49', '2403:6200:8852:a75b:4093:8d06:79d6:fffa', NULL, '1.30', '0.000', '0.00', '0.00', '0.00', '0.00', '0.00', 0, 0, '0.00', '0.00', '2.21', '', '0.00'),
(8996, NULL, 'PSG & à¸˜à¸™à¸ªà¸²à¸£à¸¢à¸´à¸¡', 'à¸­.à¸•à¹ˆà¸­à¸¢ à¸­.à¸›à¸¸à¹Šà¸ à¸­.à¸¡à¸´à¸™à¸´ à¸­.à¸à¸¸à¹Šà¸ à¸­.à¸­à¸°à¸•à¸­à¸¡', 'à¸­.à¸•à¹ˆà¸­à¸¢', '0886954287', 'psgtha888', 2034, 0, 'psgthanasan@gmail.com', '2024-02-28 10:29:07', '110.170.245.143', NULL, '1.02', '0.020', '0.00', '0.00', '0.00', '0.00', '0.00', 0, 0, '0.01', '0.00', '0.00', '', '0.00'),
(8999, NULL, 'Hussadin gym Kamphaeng Phet', 'à¸„à¸£à¸¹à¸­à¹‰à¸­ à¸„à¸£à¸¹à¸à¸­à¸¥à¹Œà¸Ÿ', '', '0655323238', '1160400051599', 2034, 0, 'aordeede@gmail.com', '2024-02-28 15:27:02', '2001:44c8:4640:2945:2da3:63aa:3f97:52ed', NULL, '1.11', '0.000', '0.00', '0.00', '0.00', '0.00', '0.00', 0, 0, '0.00', '0.00', '0.00', '', '1.00'),
(9000, NULL, 'Special Forces', 'à¸„à¸£à¸¹à¹€à¸­à¸¢à¹Œ à¸„à¸£à¸¹à¹€à¸•à¹‰ à¸„à¸£à¸¹à¹„à¸šà¹€à¸¥à¹ˆ à¸„à¸£à¸¹à¹‚à¸šà¹Šà¸— à¸„à¸£à¸¹à¹‚à¸­à¹Šà¸„', 'à¸„à¸£à¸¹à¹€à¸­à¸¢à¹Œ', '0918536157', '1234', 2034, 0, 'Bailetos0107@gmail.com', '2024-02-28 17:53:17', '171.4.218.115', NULL, '6.77', '3.240', '0.00', '0.00', '0.00', '0.00', '0.00', 0, 0, '0.02', '0.00', '2.00', '', '3.00'),
(9016, NULL, 'à¸Šà¸™à¸²à¸˜à¸²à¸£à¸™à¹ˆà¸²à¸™', 'à¸£à¸­à¸‡à¸Šà¸™à¸²à¸˜à¸´à¸›/à¸„à¸£à¸¹à¸Šà¸™à¸²à¸˜à¸²à¸£', 'à¸„à¸£à¸¹à¸Šà¸™à¸±à¸à¸Šà¸´à¸”à¸²', '0921952666', '1234', 2034, 0, 'tkd.nan@gmail.com', '2024-03-01 16:42:45', '2001:fb1:100:6742:ae31:6d26:f4c8:7f14', NULL, '0.00', '0.000', '0.00', '0.00', '0.00', '0.00', '0.00', 0, 0, '0.00', '0.00', '0.00', '', '0.00'),
(9020, NULL, 'THE-SPIRIT', 'à¸­.à¹€à¸¥à¹‡à¸', 'à¸­.à¹€à¸¡à¸†', '0817164559', 'spirit2024', 2034, 0, 'clipmtkd2013@gmail.com', '2024-03-02 21:09:16', '49.228.238.195', NULL, '6.38', '1.960', '0.00', '0.00', '0.00', '0.00', '0.00', 0, 0, '2.01', '0.00', '2.21', '', '1.00'),
(9021, NULL, 'Joseph Phichit', 'à¸„à¸£à¸¹à¸—à¸¹à¸™ , à¸„à¸£à¸¹à¹€à¸™à¸¡', 'à¸à¸¤à¸©à¸à¹Œà¸Šà¸²à¸™à¸™à¸—à¹Œ   à¹à¸ªà¸‡à¸¨à¸´à¸£à¸´', '098-5185888', 'toon300817', 2034, 0, 'kritchanontoon2517@gmail.com', '2024-03-03 12:39:26', '49.237.47.93', NULL, '1.10', '1.100', '0.00', '0.00', '0.00', '0.00', '0.00', 0, 0, '0.00', '0.00', '1.00', '', '0.00'),
(9031, NULL, 'THE LEGEND TAEKWONDO', 'à¸„à¸£à¸¹à¸ à¸¹à¸¡à¸´', '', '0835705109', '0835705109', 2034, 0, 'poomdookmai@gmail.com', '2024-03-04 10:46:36', '2405:9800:b900:1ac1:9cf5:dd7b:bfbd:7f16', NULL, '1.20', '0.100', '0.00', '0.00', '0.00', '0.00', '0.00', 0, 0, '1.00', '0.00', '0.00', '', '1.00'),
(9035, NULL, 'LIONFIGHTER', 'à¸„à¸£à¸¹à¸à¸¸à¹ˆ', '', '0841739224', '19831983', 2034, 0, 'lionmaster2012@gmail.com', '2024-03-04 19:22:10', '2403:6200:8850:1264:e51c:6917:d8de:98a2', NULL, '0.01', '0.000', '0.00', '0.00', '0.00', '0.00', '0.00', 0, 0, '0.01', '0.00', '0.00', '', '0.00'),
(9044, NULL, 'PNT Taekwondo Chiangrai', 'à¸„à¸£à¸¹à¹€à¸žà¸µà¸¢à¸§', '', '080-632-6145', '123456', 2034, 0, 'namwan.p.t.2544@gmail.com', '2024-03-06 20:50:44', '2405:9800:b913:e2d6:60d1:9456:c8e0:12cb', NULL, '0.13', '0.030', '0.00', '0.00', '0.00', '0.00', '0.00', 0, 0, '0.00', '0.00', '0.00', '', '0.00'),
(9045, NULL, 'Yaowaluck Taekwondo', 'à¸„à¸£à¸¹à¸•à¹ˆà¸­ à¸„à¸£à¸¹à¸™à¹‰à¸¸à¸‡', '', '0952255265', 'wkxaxleexcy2002', 2034, 0, 'doubleukayleecy@gmail.com', '2024-03-06 22:09:14', '49.237.19.48', NULL, '2.12', '2.120', '0.00', '0.00', '0.00', '0.00', '0.00', 0, 0, '0.00', '0.00', '0.00', '', '0.00'),
(9049, NULL, 'PantajakGym', 'à¹‚à¸„à¹Šà¸Šà¹€à¸›à¹‡à¸™à¸™à¸¸à¹ˆà¸™ à¸™à¸²à¸‡à¸ªà¸²à¸§à¸§à¸²à¸ªà¸™à¸² à¸›à¸±à¸à¸—à¸ˆà¸±à¸à¸£à¹Œ', '', '0833226848', '0833226848', 2034, 0, 'coachpennoonpantajak@gmail.com', '2024-03-07 10:00:58', '49.229.24.18', NULL, '0.01', '0.000', '0.00', '0.00', '0.00', '0.00', '0.00', 0, 0, '0.00', '0.00', '3.00', '', '0.00'),
(9051, NULL, 'à¹‚à¸£à¸‡à¹€à¸£à¸µà¸¢à¸™à¸”à¸£à¸¸à¸“à¸£à¸±à¸•à¸™à¹Œ', 'à¸­à¸´à¸', 'à¸­à¸´à¸', '0894984347', '01441468Zs', 2034, 0, 'kanprachit@gmail.com', '2024-03-07 14:15:44', '118.172.181.176', NULL, '0.00', '0.000', '0.00', '0.00', '0.00', '0.00', '0.00', 0, 0, '0.00', '0.00', '0.00', '', '0.00'),
(9054, NULL, 'RachanGym', 'à¸„à¸£à¸¹à¸Ÿà¸­à¸‡', 'à¸„à¸£à¸¹à¸™à¸‡', '0932362363', '12345', 2034, 0, 'hs5wyw.dr@gmail.com', '2024-03-07 18:39:46', '2001:fb1:10a:78c:d072:6299:df94:a3ed', NULL, '0.00', '0.000', '0.00', '0.00', '0.00', '0.00', '0.00', 0, 0, '0.00', '0.00', '0.00', '', '0.00'),
(9058, NULL, 'Athena taekwondo Lamphun', 'à¸„à¸£à¸¹à¹‚à¸”à¹‰', '-', '0837607918', '150239', 2034, 0, 'dodokungkub665@gmail.com', '2024-03-07 21:29:23', '183.89.191.103', NULL, '2.00', '0.000', '0.00', '0.00', '0.00', '0.00', '0.00', 0, 0, '0.00', '0.00', '1.10', '', '6.00'),
(9059, NULL, 'à¸¨à¸£à¸µà¸­à¸´à¸™à¸—à¸£à¸²à¸—à¸´à¸•à¸¢à¹Œà¹€à¸—à¸„à¸§à¸±à¸™à¹‚à¸”', 'à¸„à¸£à¸¹à¹€à¸›à¸£à¸¡', '', '0955498914', 'tkd1150', 2034, 0, 'teachertkd49@gmail.com', '2024-03-07 21:56:54', '223.24.171.148', NULL, '0.11', '0.010', '0.00', '0.00', '0.00', '0.00', '0.00', 0, 0, '0.00', '0.00', '0.00', '', '0.00');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `thannam_champion_teamm`
--
ALTER TABLE `thannam_champion_teamm`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `thannam_champion_teamm`
--
ALTER TABLE `thannam_champion_teamm`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9067;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
